{"hash": "784f60e6666b06076269585d31c98f5b8f50da18512af1781beff2c1fb9bc16a", "summary": {"ranking": [{"name": "david696969696969", "rank": 1, "reason": "Bro literally answered \"Where were you on the 31st December?\" with \"I'm killing on it\" 💀 like sir… wrong verb tense, right level of sus. Feels like a guilty mind trying to sound chill but just confessing lowkey."}, {"name": "ddd", "rank": 2, "reason": "Steve admitting he was there \"on the night of the murder\" and that he \"almost killed\" himself sounds like someone way too close to the action 😬 could be panicked witness… or the killer trying to play the clumsy-victim card."}, {"name": "Jane", "rank": 3, "reason": "She straight-up says she \"wouldn't even trust\" herself 💅 and gives chaotic energy, which is wild for someone near a murder scene; vibes are messy, but there’s zero direct link to the actual act so she’s more chaos than confirmed killer."}, {"name": "Andrej", "rank": 4, "reason": "Home alone watching *Knives Out* on New Year’s is super on-theme for a murder case 😂 but his story is consistent, and there’s nothing tying him to the scene except bad coincidence and movie taste."}, {"name": "Live Interview", "rank": 5, "reason": "Just said \"Hi.\" and dipped 😭 ultimate NPC energy, zero murder energy; only crime here is wasting interview time."}, {"name": "Hello", "rank": 6, "reason": "Sounds like a test recording more than a person, like the tutorial level of this whole investigation 🤖 absolutely no motive, no alibi needed, just vibes."}], "summary": "On New Year’s Eve, a murder goes down during a chaotic night where Steve (ddd) admits he was at the scene and nearly hurt himself, Jane radiates untrustworthy energy, Andrej claims he was home watching *Knives Out*, and David drops the insanely suspicious line \"I’m killing on it\" when asked where he was on the 31st. Piecing the timelines and vibes together, David comes out as the most likely killer, with Steve as a close second due to being right there when it all happened, while the others either have weak links to the scene or feel more like background noise than genuine threats. The case leans hard toward David as the prime suspect, but with mostly sketchy statements and circumstantial drama, it’s still a theory waiting on real evidence to lock it in.", "timeline": [{"title": "31st December, 8:00 PM", "content": "Friends gather at a New Year’s Eve hangout where the soon-to-be victim hosts, with Steve (ddd) and Jane in the mix as the night starts off loud and messy."}, {"title": "31st December, 10:30 PM", "content": "Things get wild; Steve nearly injures himself in some dumb stunt, giving him that \"I almost killed my ass accidentally\" story while Jane leans into her own chaotic, untrustworthy vibe."}, {"title": "31st December, 11:30 PM", "content": "Away from the main chaos, David is unaccounted for and later sums up his night as \"I’m killing on it,\" hinting at shady moves in the crucial pre-murder window."}, {"title": "31st December, 11:59 PM", "content": "In the dark edge of the party space, the victim is attacked right before midnight, with Steve nearby and dangerously close to the action as fireworks and screams blur what really happened."}, {"title": "1st January, 12:10 AM", "content": "The body is discovered just after the countdown; Steve is shaken, Jane is foggy and unreliable, and the scene is pure confusion when authorities arrive."}, {"title": "1st January, Morning", "content": "Interviews kick off: Andrej insists he was home watching *Knives Out*, David drops his \"killing on it\" bomb of a line, and a couple of filler interviews (“Hi” and a test greeting) confirm not everyone present is actually part of the murder drama."}]}}